import { Component } from '@angular/core';
import { CommonModule } from '@angular/common';
import { PageHeroComponent } from '../../shared/components/page-hero/page-hero.component';
import { RouterLink } from '@angular/router';

@Component({
  selector: 'app-rules',
  standalone: true,
  imports: [CommonModule, PageHeroComponent, RouterLink],
  templateUrl: './rules.component.html',
})
export class RulesComponent {
  generalRules = [
    { title: 'Година заїзду', value: '14:00' },
    { title: 'Година виїзду', value: '12:00' },
    { title: 'Рецепція', value: 'Цілодобово' }
  ];

  stayRules = [
    'Прибирання номерів — щоденне (поточне, при проживанні)',
    'Заміна постільної білизни — 1 раз в 3 дня (при проживанні більше ніж 3 доби)',
    'Заміна рушників — по вимозі гостя (щоденне, при поточному прибиранні)',
    'За майно готелю гість несе матеріальну відповідальність',
    'При виїзді номер здається покоївці або адміністратору',
    'Паркінг, камера схову та прасування одягу — безкоштовно для проживаючих'
  ];

  freeServices = [
    'Сніданки (входять у вартість, можна відмовитися)',
    'Паркінг під охороною',
    'Камера схову, гладильна дошка, праска',
    'Бювет з мінеральною водою «Нафтуся»'
  ];

  paidServices = [
    'Сауна (для гостей готелю знижка 10%)',
    'Конференц-зала',
    'Ресторан та бар (для гостей готелю знижка 10%)',
    'Боулінг (знижка за наявності дисконту)',
    'Тенісний корт',
    'Дитячий майданчик з атракціонами',
    'Екскурсії виїзні та по місту'
  ];

  attractions = [
    { name: 'Стрільба з лука', price: '10.00 грн', details: '5 пострілів (+3 у подарунок)' },
    { name: 'Пневматичний тир', price: '10.00 грн', details: '5 пострілів (+3 у подарунок)' },
    { name: 'Angry birds', price: '15.00 грн', details: '6 пострілів (+2 у подарунок)' },
    { name: 'Дартс', price: '10.00 грн', details: '5 кидків (+3 у подарунок)' },
    { name: 'Кольцеброс', price: '10.00 грн', details: '5 кидків (+3 у подарунок)' },
    { name: 'Джин', price: '15.00 грн', details: '5 кидків' },
    { name: 'Батут', price: '10.00 грн', details: '10 хвилин' },
    { name: 'Командне сумо', price: '20.00 грн', details: '10 хвилин (з особи)' }
  ];
}
